// 仓库坐标点
const warehouse = [
  {
    name: "西北大区",
    rpId: 1,
    data: [
      {
        name: "新疆",
        value: [87.765451, 41.032368]
      },
      {
        name: "甘肃",
        value: [103.05842, 37.49516]
      },
      {
        name: "青海",
        value: [96.378733, 36.477212]
      },
      {
        name: "内蒙古",
        value: [107.321115, 40.366041]
      },
      {
        name: "山西",
        value: [112.24299, 37.320625]
      },
      {
        name: "陕西",
        value: [108.903147, 35.194719]
      },
      {
        name: "宁夏",
        value: [106.398264, 37.947046]
      }
    ]
  },
  {
    name: "东北区",
    rpId: 1,
    data: [
      {
        name: "黑龙江",
        value: [128.019358, 46.075737]
      },
      {
        name: "辽宁",
        value: [123.4051, 41.379519]
      },
      {
        name: "吉林",
        value: [126.700998, 43.263837]
      }
    ]
  },
  {
    name: "华北大区",
    rpId: 3,
    data: [
      {
        name: "河北",
        value: [115.538889, 38.46502]
      },
      {
        name: "北京",
        value: [116.46174, 40.399515]
      },
      {
        name: "天津",
        value: [117.296701, 39.523779]
      },
      {
        name: "山东",
        value: [117.560373, 36.935218]
      }
    ]
  },
  {
    name: "华东一区",
    rpId: 3,
    data: [
      {
        name: "江苏",
        value: [119.801584, 34.164807]
      }
    ]
  },
  {
    name: "上海特区",
    rpId: 1,
    data: [
      {
        name: " 上海",
        value: [121.427561, 31.244074]
      }
    ]
  },
  {
    name: "华东二区",
    rpId: 2,
    data: [
      {
        name: "安徽",
        value: [118.043772, 30.224223]
      },
      {
        name: "浙江",
        value: [120.021311, 29.691191]
      },
      {
        name: "福建",
        value: [117.955881, 26.748836]
      }
    ]
  },
  {
    name: "华中大区",
    rpId: 3,
    data: [
      {
        name: "河南",
        value: [113.56135, 33.177365]
      },
      {
        name: "湖南",
        value: [111.49592, 28.655201]
      },
      {
        name: "湖北",
        value: [113.121897, 31.506709]
      },
      {
        name: "江西",
        value: [115.890451, 28.578046]
      }
    ]
  },
  {
    name: "华南大区",
    rpId: 1,
    data: [
      {
        name: "广东",
        value: [113.693186, 23.385914]
      },
      {
        name: "广西",
        value: [108.947092, 24.310345]
      },
      {
        name: "澳门",
        value: []
      },
      {
        name: "香港",
        value: []
      },
      {
        name: "海南",
        value: [110.045725, 19.625295]
      }
    ]
  },
  {
    name: "华西大区",
    rpId: 2,
    data: [
      {
        name: "西藏",
        value: []
      },
      {
        name: "四川",
        value: [103.981272, 30.148251]
      },
      {
        name: "四川2",
        value: [102.355295, 31.992506]
      },
      {
        name: "云南",
        value: [101.56428, 25.386999]
      },
      {
        name: "重庆",
        value: [107.804514, 30.319106]
      },
      {
        name: "贵州",
        value: [106.222483, 26.178401]
      }
    ]
  }
];
export default warehouse;
